# 0) ახსენით როგორ მუშაობს სლაისინგი
# 1) შექმენით სია სადაც შეინახავთ მანქანებს და გამოიტანეთ 3დან 5ის ჩათვლით ყველა მანქანა
# 2) მომხმარებელს შემოატანინეთ სახელი და შემდეგ დაპრინტეთ პირველი და ბოლო ასოს გარეშე
# 3) მომხმარებელს შემოატანინეთ სახელი და ასევე შექმენით სია, 
# შემდეგ გამოიტანეთ სახელის მეორე ნახევარი და სიის პირველი ნახევარი
# 4) მომხმარებელს შემოატანინეთ სახელი, 
# შემდეგ თუ ეს სახელი იწყება "რ"-ზე, მაშინ დაპრინტეთ "Hello", 
# ხოლო სხვა შემთხვევაში დაპრინტეთ "Bye" (დაგჭირდებათ სლაისინგი და if/else)

# 0)
# სლაისინგი გამოიყენება სტრინგიდან ან სიიდან
# კონკრეტული ნაწილის ამოსაღებად.
# ფორმატი: [start:end:step]
# start - საიდან დაიწყოს
# end - სადამდე მივიდეს
# step - რამდენი ნაბიჯით გადაადგილდეს

# მაგალითი:
word = "Python"

print(word[0:3])   
print(word[1:5])   
print(word[::-1])  


# 1) 
cars = ["BMW", "Mercedes", "Audi", "Toyota", "Honda", "Ford"]

print(cars[2:5])  



# 2) 
name = input("შეიყვანე სახელი: ")

print(name[1:-1])


# 3) 
name = input("შეიყვანე სახელი: ")
numbers = [1, 2, 3, 4, 5, 6]

middle = len(name) // 2
print(name[middle:])

middle_list = len(numbers) // 2
print(numbers[:middle_list])


# 4)
name = input("შეიყვანე სახელი: ")

if name[0:1] == "რ":
    print("Hello")
else:
    print("Bye")
