// 0) გაიარეთ codecademy "Function Expressions" - მდე

// image.png


// 1) შექმენი სამი ცვლადი:
// balance (ამჟამინდელი ბალანსი, მაგ: 500)
// withdrawAmount (რამდენის გატანა სურს, მაგ: 600)
// isAccountActive (ბულიონი - აქტიურია თუ არა ბარათი, მაგ: true)
// ქეისი 1: თუ ანგარიში არააქტიურია (!isAccountActive) -> გამოიტანე: "ტრანზაქცია უარყოფილია: ბარათი დაბლოკილია."
// ქეისი 2: თუ გასატანი თანხა მეტია ბალანსზე -> გამოიტანე: "არასაკმარისი ნაშთი."
// ქეისი 3: თუ გასატანი თანხა ნაკლებია ან ტოლია 0-ზე -> გამოიტანე: "გთხოვთ, მიუთითოთ ვალიდური თანხა."
// ქეისი 4: თუ გასატანი თანხა ზუსტად ბალანსის ტოლია -> გამოიტანე: "ტრანზაქცია სრულდება. თქვენი ბალანსი ნულდება!"
// Default: ყველა სხვა შემთხვევაში (ანუ როცა თანხა საკმარისია და ბარათიც მუშაობს) -> გამოიტანე: "ტრანზაქცია წარმატებულია.".

let balance = 500;
let withdrawAmount = 600;
let isAccountActive = true;

if (!isAccountActive) {
    console.log("ტრანზაქცია უარყოფილია: ბარათი დაბლოკილია.");
} else if (withdrawAmount > balance) {
    console.log("არასაკმარისი ნაშთი.");
} else if (withdrawAmount <= 0) {
    console.log("გთხოვთ, მიუთითოთ ვალიდური თანხა.");
} else if (withdrawAmount === balance) {
    console.log("ტრანზაქცია სრულდება. თქვენი ბალანსი ნულდება!");
} else {
    console.log("ტრანზაქცია წარმატებულია.");
}


// 2) შექმენი Helper ფუნქცია isAllowed, რომელიც პარამეტრად მიიღებს ასაკს (age).
// ფუნქციის შიგნით გამოიყენე if/else:
// თუ ასაკი არის 18 ან მეტი, ფუნქციამ უნდა დააბრუნოს ტექსტი: "წვდომა დაშვებულია".
// თუ ნაკლებია, უნდა დააბრუნოს: "წვდომა აკრძალულია".
// შემდეგ შექმენი მასივი (ან უბრალოდ 3 ცვლადი) სხვადასხვა ასაკით (მაგ: 15, 20, 18).
// თითოეულისთვის გამოიძახე isAllowed და დაბეჭდე პასუხი.

function isAllowed(age) {
    if (age >= 18) {
        return "წვდომა დაშვებულია";
    } else {
        return "წვდომა აკრძალულია";
    }
}

let age1 = 15;
let age2 = 20;
let age3 = 18;

console.log(isAllowed(age1));
console.log(isAllowed(age2));
console.log(isAllowed(age3));
