// 1. კომენტარებით ახსენით რას შვება .forEach, .filter, .map, .some, 
// ასევე კომენტარებით ახსენით რას ნიშნავს high order functions

// 2. .forEach
// მოცემულობა: გაქვს სახელების მასივი: ['ანა', 'ნიკა', 'გიორგი'].
// მიზანი: forEach-ის გამოყენებით, კონსოლში გამოიტანე თითოეული სახელი მისალმებასთან ერთად.

// 3. .map 
// მოცემულობა: გაქვს მასივი: [2, 4, 6, 8].
// მიზანი: map-ის გამოყენებით შექმენი ახალი მასივი, სადაც თითოეული რიცხვი გამრავლებული იქნება 2-ზე.

// 4. .filter 
// მოცემულობა: გაქვს ასაკების მასივი: [12, 25, 17, 30, 15].
// მიზანი: filter-ის გამოყენებით შექმენი ახალი მასივი, რომელშიც მხოლოდ 18 წლის ან უფროსი ასაკის რიცხვები მოხვდება.

// 5. .some
// მოცემულობა: გაქვს მასივი: [5, 8, -2, 10].
// მიზანი: some-ის გამოყენებით გაარკვიე, არის თუ არა მასივში თუნდაც ერთი უარყოფითი (0-ზე ნაკლები) რიცხვი.


// 1.
// .forEach()
// გადაუვლის მასივის თითოეულ ელემენტს და ასრულებს მოცემულ ფუნქციას
// არაფერს არ აბრუნებს (undefined)
// გამოიყენება როცა უბრალოდ მოქმედება გვინდა (მაგ. დაბეჭდვა)
// .map()
// ქმნის ახალ მასივს, სადაც თითოეული ელემენტი გარდაქმნილია
// აბრუნებს ახალ მასივს იგივე სიგრძით
// .filter()
// ქმნის ახალ მასივს მხოლოდ იმ ელემენტებით, რომლებიც აკმაყოფილებენ პირობას
// აბრუნებს ახალ მასივს (შეიძლება მოკლე იყოს)
// .some()
// ამოწმებს არსებობს თუ არა მაინც ერთი ელემენტი, რომელიც აკმაყოფილებს პირობას
// აბრუნებს true ან false

// მაღალი რიგის ფუნქციები (High Order Functions)
// ეს არის ფუნქციები, რომლებიც:
// იღებენ სხვა ფუნქციას არგუმენტად
// ან აბრუნებენ ფუნქციას შედეგად.


// 2.
const names = ['ანა', 'ნიკა', 'გიორგი'];

names.forEach(item => {
  console.log(`გამარჯობა, ${item}!`);
});


// 3.
const numbers = [2, 4, 6, 8];

const doubled = numbers.map(num => {
  return num * 2;
});

console.log(doubled);


// 4.
const ages = [12, 25, 17, 30, 15];

const adults = ages.filter(age => {
  return age >= 18;
});

console.log(adults);



// 5.
const nums = [5, 8, -2, 10];

const hasNegative = nums.some(num => {
  return num < 0;
});

console.log(hasNegative);


