// ახსენით რა განსხვავებაა ჩვეულებრივ ფუნქციასა და arrow ფუნციას შორის და მოიყვანე ერთი მაგალითი arrow ფუნქციაზე

// ჩვეულებრივი ფუნქცია იწერება ასე:

function sum(a, b) {
  return a + b;
}

// arrow ფუნქცია კი უფრო მოკლე და თანამედროვე სინტაქსია:

const sum = (a, b) => a + b;

// მთავარი განსხვავება:
// სინთაქსი და წერა

// 1) დაწერე ფუნქცია add, რომელიც ორ რიცხვს მიიღებს და მათ ჯამს დააბრუნებს.

const add = (a, b) => {
    return a + b;
}
console.log(add(5, 3));


// 2) შექმენი ფუნქცია square, რომელიც მიიღებს ერთ რიცხვს და დააბრუნებს მის კვადრატს (თავის თავზე ნამრავლს).

const square = (num) => {
    return num * num;
}
console.log(square(4));


// 3) შექმენი ფუნქცია halfPrice, რომელიც მიიღებს ნივთის ფასს და დააბრუნებს მის ნახევარს.

const halfPrice = (price) => {
    return price / 2;
}
console.log(halfPrice(100));

