// 1) ახსენით რას შვება Promise.all() 
// რა პლიუსები აქვს მას და რა მინუსები ასევე დაწერეთ 1 მაგალითი მასზე

// Promise.all() გამოიყენება მაშინ, როცა რამდენიმე Promise-ის ერთდროულად შესრულება გვინდა

// პლიუსები:

// ერთდროულად ასრულებს რამდენიმე ასინქრონულ ოპერაციას,
// სწრაფია,
// შედეგებს გვიბრუნებს ერთ array-ში.

// მინუსები:

// თუ ერთი Promise ჩავარდა, Promise.all() მთლიანად reject ხდება.


// 2) ახსენიოთ რაში გვეხამრება HTTP Request ები

// HTTP Request არის მოთხოვნა, რომელსაც Client უგზავნის Server-ს, 
// რათა მიიღოს ან შეცვალოს ინფორმაცია.

// HTTP Request-ების გამოყენებით შეგვიძლია:

// მონაცემების მიღება,
// ახალი მონაცემების გაგზავნა,
// მონაცემების შეცვლა,
// მონაცემების წაშლა.


// 3) ახსენით რა არის: Client,  Server, HTTP, TCP, სტატუს კოდი 200 და 404, 

// Client არის მოწყობილობა, რომელიც სერვერს უგზავნის მოთხოვნას.
// Server არის კომპიუტერი, რომელიც იღებს Client-ის მოთხოვნას, ამუშავებს მას და აბრუნებს პასუხს.
// HTTP არის პროტოკოლი, რომლის საშუალებითაც ბრაუზერი და სერვერი ერთმანეთთან ინფორმაციას ცვლიან.
// TCP არის პროტოკოლი, რომელიც უზრუნველყობს მონაცემების სანდოდ და სწორად გადაცემას ორ მოწყობილობის შორის.
// 200 ნიშნავს, რომ მოთხოვნა წარმატებით შესრულდა.
// 404 ნიშნავს, რომ მოთხოვნილი რესურსი ვერ მოიძებნა.

// რა განსხვავებაა HTTP-სა და HTTPS-ს შორის?

// HTTP არის პროტოკოლი, რომლის საშუალებითაც ბრაუზერი და სერვერი ერთმანეთთან ინფორმაციას ცვლიან.
// HTTPS იგივეა, უბრალოდ HTTP-ის უსაფრთხო ვერსიაა
