// // 1) შექმენი ასინქრონული ფუნქცია სახელად startCountdown, რომელიც კონსოლში თანმიმდევრობით დაბეჭდის შემდეგ ტექსტებს, თითოეულ ნაბიჯს შორის 1-წამიანი დაყოვნებით:
// "მზადება იწყება..." (დაელოდე 1 წამი)
// "3..." (დაელოდე 1 წამი)
// "2..." (დაელოდე 1 წამი)
// "1..." (დაელოდე 1 წამი)
// "გაშვება!"
// მინიშნება: გამოიყენე დამხმარე ფუნქცია, რომელიც აბრუნებს Promise-ს setTimeout-ით.

function delay(ms) {
    return new Promise((resolve) => {
        setTimeout(resolve, ms);
    });
}

async function startCountdown() {
    console.log("მზადება იწყება...");
    await delay(1000);

    console.log("3...");
    await delay(1000);

    console.log("2...");
    await delay(1000);

    console.log("1...");
    await delay(1000);

    console.log("გაშვება!");
}

startCountdown();


// // 2) შექმენი ასინქრონული ფუნქცია processOrder(orderId), რომელიც ასრულებს შეკვეთის დამუშავების სიმულაციას ეტაპობრივად. თითოეულ ეტაპს შორის უნდა იყოს 1.5-წამიანი დაყოვნება.
// კონსოლში თანმიმდევრობით უნდა იბეჭდებოდეს:
// შეკვეთა #${orderId} მიღებულია. ვამოწმებთ მარაგს... (დაელოდე 1.5 წამი)
// თანხა წარმატებით ჩამოიჭრა. მიმდინარეობს შეფუთვა... (დაელოდე 1.5 წამი)
// შეკვეთა გადაეცა კურიერს! მადლობა რომ სარგებლობთ ჩვენით.
// მინიშნება: გამოიყენე დამხმარე ფუნქცია, რომელიც აბრუნებს Promise-ს setTimeout-ით.

function delay(ms) {
    return new Promise((resolve) => {
        setTimeout(resolve, ms);
    });
}

async function processOrder(orderId) {
    console.log(`შეკვეთა #${orderId} მიღებულია. ვამოწმებთ მარაგს...`);
    await delay(1500);

    console.log("თანხა წარმატებით ჩამოიჭრა. მიმდინარეობს შეფუთვა...");
    await delay(1500);

    console.log("შეკვეთა გადაეცა კურიერს! მადლობა რომ სარგებლობთ ჩვენით.");
}

processOrder(101);