// 1) კომენტარებით ახსენით რას ნიშნავს სინქრონულობა და ასნიქრონულობა

// JavaScript-ში კოდის შესრულება ორი ძირითადი მოდელით ხდება: 
// სინქრონული (Synchronous) და ასინქრონული (Asynchronous).
// 1. სინქრონული (Synchronous) JavaScript
// სინქრონულ მოდელში ინსტრუქციები სრულდება მიმდევრობით — ხაზ-ხაზად. 
// ყოველი მომდევნო ოპერაცია ელოდება წინა ოპერაციის დასრულებას
// 2. ასინქრონული (Asynchronous) JavaScript
// ასინქრონულ მოდელში ხანგრძლივი ოპერაციები იშვება "ფონურ რეჟიმში", 
// რის გამოც კოდის შესრულება არ ჩერდება. 
// როდესაც ფონური დავალება დასრულდება, 
// JavaScript იძახებს შესაბამის პასუხს.
// როდის გამოიყენოთ სინქრონული კოდი:
// როდესაც მოქმედებები აუცილებლად ერთმანეთზეა დამოკიდებული 
// როდესაც ოპერაციას სჭირდება მილიწამების ფრაქცია და არ აფერხებს სამომხმარებლო ინტერფეისს (UI).
// მასივების ფილტრაცია, ობიექტების მანიპულაცია და ა.შ.
// როდის გამოიყენოთ ასინქრონული კოდი:
// სერვერიდან მონაცემების წამოღება ან გაგზავნა. 
// რადგან ინტერნეტის სიჩქარე და სერვერის პასუხი უცნობია.
// დიდ ფაილებთან მუშაობა.
// setTimeout, setInterval, მომხმარებლის კლიკები ან ღილაკზე დაჭერის მოსმენა.
// ბაზიდან ჩანაწერების ამოღება ან განახლება.


// 2) შექმენით პროგრამა, რომელიც კონსოლში თანმიმდევრულად დაბეჭდის სამ სიტყვას 
// ("პირველი", "მეორე", "მესამე"), მაგრამ არა ერთდროულად:
// "პირველი" უნდა დაიბეჭდოს მაშინვე (სინქრონულად).
// "მეორე" უნდა დაიბეჭდოს 2 წამის დაგვიანებით (setTimeout).
// "მესამე" უნდა დაიბეჭდოს 1 წამის დაგვიანებით (setTimeout).

console.log("პირველი");

const oneByOne = () => {
    return new Promise((resolve, reject) => {
        setTimeout(() => {
            console.log("მეორე");
        }, 2000);

        setTimeout(() => {
            console.log("მესამე");
        }, 1000);
    });
}

oneByOne().then((result) => {console.log(result); }).catch((error) => {console.log("დაფიქსირდა შეცდომა:", error);});


// 3) შექმენით ახალი Promise სახელად checkEvenNumber, 
// რომელიც ამოწმებს რაიმე ფიქსირებულ რიცხვს (მაგალითად, 4-ს).
// თუ რიცხვი ლუწია, პრომისი წარმატებით უნდა დასრულდეს (resolve) და ტექსტად დააბრუნოს: 
// "რიცხვი ლუწია".
// თუ რიცხვი კენტია, პრომისი უნდა დაირღვეს (reject) და ტექსტად დააბრუნოს: "რიცხვი კენტია".

const checkEvenNumber = () => {
    return new Promise((resolve, reject) => {
        const number = 4;
        if (number % 2 === 0) {
            resolve("რიცხვი ლუწია");
        } else {
            reject("რიცხვი კენტია");
        }
    });
}

checkEvenNumber.then((result) => {console.log(result);}).catch((error) => {console.log("დაფიქსირდა შეცდომა:", error);});
