// 1. რას ნიშნავს conditional rendering React-ში?

// Conditional Rendering არის ელემენტების ჩვენება გარკვეული პირობის მიხედვით.


// 2. როგორ შეგვიძლია React-ში ელემენტის ჩვენება მხოლოდ მაშინ, როცა პირობა true არის?

// შეგვიძლია გამოვიყენოთ && ოპერატორი.


// 3. რას აკეთებს ეს კოდი თუ isLoggedIn დააბრუნებს Trueს?
// {isLoggedIn && <h1>Welcome!</h1>}

// თუ isLoggedIn არის true, ეკრანზე გამოჩნდება <h1>Welcome!</h1>.


// 4. როგორ ვიყენებთ ternary operator-ს React-ში?

// Ternary operator გამოიყენება ორი სხვადასხვა შედეგიდან ერთ-ერთის გამოსატანად.
// მისი ფორმაა: პირობა ? true-ის შედეგი : false-ის შედეგი.


// 5. რა განსხვავებაა &&-ით და ternary operator-ით პირობის დაწერას შორის React-ში?

// && გამოიყენება ელემენტის მხოლოდ მაშინ გამოსატანად, როცა პირობა true არის.
// თუ პირობა false არის, ელემენტი არ გამოჩნდება.

// Ternary operator გამოიყენება ორი განსხვავებული შედეგის გამოსატანად.
// თუ პირობა true არის, გამოჩნდება პირველი ელემენტი,
// ხოლო თუ false არის — მეორე ელემენტი.