// JavaScript-ში კოდის შესრულება ორი ძირითადი მოდელით ხდება: 
// სინქრონული (Synchronous) და ასინქრონული (Asynchronous).
// 1. სინქრონული (Synchronous) JavaScript
// სინქრონულ მოდელში ინსტრუქციები სრულდება მიმდევრობით — ხაზ-ხაზად. 
// ყოველი მომდევნო ოპერაცია ელოდება წინა ოპერაციის დასრულებას
// 2. ასინქრონული (Asynchronous) JavaScript
// ასინქრონულ მოდელში ხანგრძლივი ოპერაციები იშვება "ფონურ რეჟიმში", 
// რის გამოც კოდის შესრულება არ ჩერდება. 
// როდესაც ფონური დავალება დასრულდება, 
// JavaScript იძახებს შესაბამის პასუხს.
// როდის გამოიყენოთ სინქრონული კოდი:
// როდესაც მოქმედებები აუცილებლად ერთმანეთზეა დამოკიდებული 
// როდესაც ოპერაციას სჭირდება მილიწამების ფრაქცია და არ აფერხებს სამომხმარებლო ინტერფეისს (UI).
// მასივების ფილტრაცია, ობიექტების მანიპულაცია და ა.შ.
// როდის გამოიყენოთ ასინქრონული კოდი:
// სერვერიდან მონაცემების წამოღება ან გაგზავნა. 
// რადგან ინტერნეტის სიჩქარე და სერვერის პასუხი უცნობია.
// დიდ ფაილებთან მუშაობა.
// setTimeout, setInterval, მომხმარებლის კლიკები ან ღილაკზე დაჭერის მოსმენა.
// ბაზიდან ჩანაწერების ამოღება ან განახლება.


// 1) შექმენით ფუნქცია waitTwoSeconds, რომელიც აბრუნებს ახალ Promise-ს. 
// ამ Promise-მა 2 წამის (setTimeout) შემდეგ წარმატებით უნდა დააბრუნოს (resolve) ტექსტი: 
// "2 წამი გავიდა!". 
// გამოიძახეთ ეს ფუნქცია და მიღებული შედეგი დაბეჭდეთ კონსოლში .then() მეთოდის გამოყენებით.

const waitTwoSeconds = () => {
    return new Promise((resolve, reject) => {
        setTimeout(() => {
            resolve("2 წამი გავიდა!"); 
        }, 2000);
    });
}

waitTwoSeconds().then((result) => {console.log(result); }).catch((error) => {console.error("დაფიქსირდა შეცდომა:", error);});


// 2) შექმენით ფუნქცია checkNumber(num), რომელიც იღებს რიცხვს და აბრუნებს Promise-ს.
// თუ რიცხვი მეტია ან ტოლია 5-ზე, Promise-მა უნდა დააბრუნოს (resolve) ტექსტი: 
// "რიცხვი ნორმალურია!".
// თუ რიცხვი 5-ზე ნაკლებია, Promise-მა უნდა გამოიწვიოს შეცდომა (reject) ტექსტით: 
// "რიცხვი ძალიან პატარაა!".

const checkNumber = (num) => {
    return new Promise((resolve, reject) => {
        if (num >= 5) {
            resolve("რიცხვი ნორმალურია!");
        } else {
            reject("რიცხვი ძალიან პატარაა!");
        }
    });
}

checkNumber(8).then((result) => {console.log("წარმატება:", result); }).catch((error) => {console.error("შეცდომა:", error);});

checkNumber(3).then((result) => {console.log("წარმატება:", result);}).catch((error) => {console.error("შეცდომა:", error);});


// 3) შექმენით ფუნქცია doubleAfterDelay(num), რომელიც იღებს რიცხვს, 
// აბრუნებს Promise-ს და 1 წამის შემდეგ აბრუნებს ამ რიცხვს გამრავლებულს 2-ზე (num * 2).

const doubleAfterDelay = (num) => {
    return new Promise((resolve) => {
        setTimeout(() => {
            resolve(num * 2); 
        }, 1000);
    });
}

doubleAfterDelay(5).then((result) => {console.log("შედეგი:", result);});
