// 1)მოიძიეთ დეტალური ინფორმაცია და ახსენით რა არის მოდული და რაში არის საჭირო,როდის ვიყენებთ

// მოდული არის კოდის ცალკე ფაილი, რომელიც შეიცავს ფუნქციებს, კლასებს, ცვლადებს ან სხვა ლოგიკას და მისი გამოყენება შეგვიძლია სხვა ფაილებში.


// 2)დააინსტალირეთ node და სცადეთ თქვენი კოდის გაშვება node ის დახმარებით
// დავალება 3: "მათემატიკური დამხმარე"შექმენი კლასი MathHelper, რომელსაც ექნება შემდეგი სტატიკური მეთოდები:
// 1)isEven(number): აბრუნებს true-ს თუ რიცხვი ლუწია, სხვა შემთხვევაში — false.
// 2)average(numbers): იღებს რიცხვების მასივს და აბრუნებს მათ საშუალო არითმეტიკულს.
// მოთხოვნა: კოდში არ გამოიყენო new MathHelper(). მეთოდებს მიმართე პირდაპირ კლასიდან.
// დავალება 4: "კალკულატორის მოდული"
// შექმენი ორი ფაილი:
// ფაილი 1: calculator.js
// შექმენი და დააექსპორტე (named export) მარტივი ფუნქციები: add(a, b) და subtract(a, b).
// შექმენი და დააექსპორტე (default export) კლასი Calculator, რომელსაც ექნება მეთოდი multiply(a, b).
// ფაილი 2: main.js
// დააიმპორტე ფუნქციები და კლასი calculator.js-დან.
// გამოიყენე ყველა ფუნქცია და დაბეჭდე შედეგები კონსოლში.
// 3. კომბინირებული დავალება: "ავტომობილების მენეჯერი"
// ეს დავალება აერთიანებს ორივე თემას და გვეხმარება ლოგიკურ დაყოფაში.
// ნაბიჯი 1: მოდულის შექმნა (Car.js)
// შექმენი კლასი Car, რომელსაც აქვს:
// კონსტრუქტორი: brand და model.
// სტატიკური მეთოდი compare(car1, car2): ეს მეთოდი უნდა იღებდეს ორ მანქანას და აბრუნებდეს ტექსტს: "ეს მანქანები ერთი ბრენდისაა", თუ მათი brand ერთნაირია.
// დააექსპორტე ეს კლასი.
// ნაბიჯი 2: გამოყენება (app.js)
// დააიმპორტე Car კლასი.
// შექმენი ორი მანქანის ობიექტი (მაგალითად: Toyota Camry და Toyota Corolla).
// გამოიყენე სტატიკური მეთოდი Car.compare() მათ შესადარებლად.

// https://nodejs.org/en/download

class Car {
    constructor(brand, model) {
        this.brand = brand;
        this.model = model;
    }

    static compare(car1, car2) {
        if (car1.brand === car2.brand) {
            return "ეს მანქანები ერთი ბრენდისაა";
        }

        return "ეს მანქანები სხვადასხვა ბრენდისაა";
    }
}

module.exports = {
    Car
}