// 1) რიცხვების "ფილტრი" (for loop)
// გაქვს მასივი: const numbers = [15, 2, 8, 33, 20, 7, 44, 11];
// დავალება: გამოიყენე for ციკლი და დაბეჭდე მხოლოდ ის რიცხვები, რომლებიც 10-ზე მეტია.

const numbers = [15, 2, 8, 33, 20, 7, 44, 11];

for (let i = 0; i < numbers.length; i++) {
    if (numbers[i] > 10) {
        console.log(numbers[i]);
    }
}


// 2) შექმენით რამე პაროლი, შემდეგ მომხმარებელს შემოატანინეთ prompt ის საშუალებით და იქამდე შემოაყვანინეთ სანამ სწორი არ იქნება 

const password = "1234";
let userInput = prompt("შეიყვანე პაროლი:");

if (userInput === password) {
    alert("correct");
    break;
} else {
    alert("incorrect");
}


// 3) შემთხვევითი რიცხვის გამოცნობა (while loop)
// დავალება: პროგრამამ უნდა "ჩაიფიქროს" რიცხვი (მაგ: const secret = 7;). გამოიყენე while(true) ციკლი და prompt(), რომ მომხმარებელს სთხოვო რიცხვის გამოცნობა. ციკლი გაჩერდეს (break) მხოლოდ მაშინ, როცა მომხმარებელი სწორ რიცხვს შეიყვანს.

const secret = 7;

while (true) {
    let guess = Number(prompt("გამოიცანი რიცხვი:"));

    if (guess === secret) {
        alert("გილოცავ! სწორად გამოიცანი!");
        break;
    } else {
        alert("არასწორია, სცადე თავიდან!");
    }
}


// 4) ზოგჯერ მომხმარებელს სთხოვ შემოიყვანოს რიცხვი 10-დან 20-მდე. თუ არასწორად შემოიყვანს, prompt თავიდან უნდა ამოხტეს.
// დავალება: გამოიყენე do...while, რომ მომხმარებელს მინიმუმ ერთხელ სთხოვო რიცხვი.
// პირობა: ციკლი გაგრძელდეს, სანამ შეყვანილი რიცხვი ნაკლებია 10-ზე ან მეტია 20-ზე.

let num;

do {
    num = Number(prompt("შეიყვანე რიცხვი 10-დან 20-მდე:"));
} while (num < 10 || num > 20);

alert("სწორია!");