// 0)რა არის React?

// React არის JavaScript-ის ბიბლიოთეკა, 
// რომელიც გამოიყენება მომხმარებლის ინტერფეისების (UI) შესაქმნელად.


// 1)რისთვის გამოიყენება React?

// React გამოიყენება ვებ-გვერდებისა და ვებ-აპლიკაციების შესაქმნელად.


// 2)რა არის კომპონენტი React-ში?

// კომპონენტი არის UI-ის დამოუკიდებელი, ხელახლა გამოყენებადი ნაწილი.


// 3)რა არის JSX?

// JSX არის სინტაქსი, 
// რომელიც საშუალებას გვაძლევს JavaScript-ის კოდში HTML-ის მსგავსი სტრუქტურა დავწეროთ.


// 4)რა განსხვავებაა ჩვეულებრივ HTML-სა და React-ში დაწერილ JSX-ს შორის?

// HTML	                                            JSX
// გამოიყენება HTML ფაილებში	                    გამოიყენება JavaScript/React კოდში
// class ატრიბუტი	                              className ატრიბუტი
// for	                                           htmlFor
// შეიძლება პირდაპირ HTML-ში ჩაიწეროს	           JavaScript-ის შიგნით გამოიყენება
// JavaScript-ის ჩასმა პირდაპირ შეზღუდულია	     JavaScript-ის expression-ები {}-ში შეგვიძლია გამოვიყენოთ