# 1) ახსენით რას აკეთებს try/except და რისთვის ვიყენებთ მას
# 2) ახსენით რას აკეთებს finally
# 3) შექმენით პროგრამა რომელიც მომხმარებელს შემოატანინებს რიცხვების სიას. სცადეთ ყველა ელემენტის int-ად გადაქცევა. თუ რომელიმე ელემენტი რიცხვი არ არის გამოიყენეთ try/except და დაბეჭდეთ "სიაში არასწორი მონაცემია".
# 4) შექმენით პროგრამა სადაც არის სია. მომხმარებელს შემოატანინეთ ინდექსი და სცადეთ ელემენტის წაშლა (pop). თუ ინდექსი არ არსებობს გამოიყენეთ try/except და დაბეჭდეთ "ინდექსი არ არსებობს".
# 5) შექმენით პროგრამა რომელიც მომხმარებელს შემოატანინებს რიცხვს. თუ მომხმარებელმა შემოიტანა სტრინგი მაშინ დაბეჭდეთ "არასწორი ასაკი"

# 1)
# try ბლოკში ვწერთ იმ კოდს, სადაც შეიძლება მოხდეს შეცდომა.
# except ბლოკი მუშაობს მაშინ, როდესაც try-ში მოხდა error.

# 2)
# finally ბლოკი ყოველთვის შესრულდება, არ აქვს მნიშვნელობა error-ია თუ არა

# 3)
li = input("შეიყვანეთ რიცხვების სია: ")

numbers = input.split()

try:
    for i in range(len(numbers)):
        numbers[i] = int(numbers[i])
    
    print(numbers)

except ValueError:
    print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ რიცხვები!")

# 4)
list =[1,2,3,4,5,6,7,8]

try:
    index = int(input("შეიყვანეთ ინდექსი: "))

    print(numbers[index])


except ValueError:
    print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ რიცხვები!")

except IndexError:
    print("შეცდომა: ასეთი ინდექსი სიაში არ არსებობს!")

# 5)
try:
    age = int(input("შეიყვანეთ თქვენი ასაკი: "))

except ValueError:
    print("შეცდომა: არასწორი ასაკი")

