# 1) https://youtu.be/zMOE_vAr5u4?si=-7isw2C0Vb8weJQ6

# 1)
# სიმრავლე (Set) Python-ში არის მონაცემთა ტიპი, რომელიც ინახავს უნიკალურ ელემენტებს. 
# სიმრავლეში ერთი და იგივე მნიშვნელობა ორჯერ ვერ იქნება.

numbers = {1, 2, 2, 3, 3, 4}
print(numbers)

# პასუხი: {1, 2, 3, 4}

# საშუალო (Average) არის რამდენიმე რიცხვის ჯამის გაყოფა მათი რაოდენობის მიხედვით.

# საშუალო = რიცხვების რაოდენობა / რიცხვების ჯამი​

# ალან ტიურინგი (Alan Turing, 1912-1954) იყო ბრიტანელი მათემატიკოსი, ლოგიკოსი და კომპიუტერული მეცნიერების ერთ-ერთი ფუძემდებელი.

# svm არის მოდული, რომელიც მიცემული სავარჯოშო მონაცემებისა და პრეცედენტების მიხედვით, ადგენს გამყობ ზედაბირს და ჰქმნის ქვასიფიკატორს

# svm.SVC() - ანუ შეიქმნა ცარიელი ქვასიფიკატორი