# 1) შემქენით პროგრამა რომელიც მომხმარებელს შემოატანინებს ორ რიცხვს და ყოფს ერთამენთზე. გამოიყენეთ try / except რომ პროგრამა არ გაჩერდეს თუ მომხმარებელმა შემოიტანა 0
# 2) შექმენით პროგრამა რომელიც მომხმარებელს სთხოვს რიცხვის შეყვანას. თუ მომხმარებელმა რიცხვის ნაცვლად ტექსტს შეიყვანს გამოიტანეთ შესაბამისი მესიჯი.
# 3) შექმენით სია და მომხმარებელს შემოატანინეთ ინდექსი. გამოიყენეთ try და except, რათა პროგრამამ error არ გამოიტანოს თუ ინდექსი სიაში არ არსებობს
# 4) შექმენით პროგრამა რომელიც მომხმარებელს სთხოვს რიცხვს და შემდეგ გამოაქვს მისი კვადრატი. გამოიყენეთ try და except, რათა თავიდან აიცილოთ არასწორი მონაცემის შეყვანა

# 1)
try:
    num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
    num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

    result = num1 / num2

    print(result)

except ZeroDivisionError:
    print("შეცდომა: 0-ზე გაყოფა არ შეიძლება!")

except ValueError:
    print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ რიცხვები!")


# 2)
try:
    number = int(input("შეიყვანეთ რიცხვი: "))

    print(number)

except ValueError:
    print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ რიცხვები!")

# 3)
numbers = [10, 20, 30, 40, 50]

try:
    index = int(input("შეიყვანეთ ინდექსი: "))

    print(numbers[index])

except IndexError:
    print("შეცდომა: ასეთი ინდექსი სიაში არ არსებობს!")

except ValueError:
    print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ რიცხვი!")

# 4)
try:
    num = int(input("შეიყვანეთ რიცხვი: "))

    print(num * num)

except ValueError:
    print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ რიცხვი!")
