# 0) კომენტარებით დაწერეთ ყველა control flowს ტექნიკა
# 1) კომენტარებით დაწერეთ რა არის ალგორითმი
# 2) კომენტარებით ახსენით რა არის საიტერაციო ცვლადი
# 3) დაწერეთ კოდი for ციკლით, რომლითაც გამოიტანთ თქვენს სახელს 10-ჯერ და თქვენს ასაკს 20-ჯერ

# 0)
# 1. if
#     if გამოიყენება მაშინ, როცა გვინდა პირობის შემოწმება.
# თუ პირობა true არის, კოდი შესრულდება.

# 2. else
# else მუშაობს if-თან ერთად.
# თუ if-ის პირობა false იქნება, შესრულდება else ბლოკი.

# 3. elif
# elif გამოიყენება დამატებითი პირობების შესამოწმებლად.

# 4. for loop
# for ციკლი გამოიყენება მაშინ, როცა წინასწარ ვიცით რამდენჯერ უნდა განმეორდეს კოდი.

# 5. while loop
# while ციკლი მუშაობს მანამ, სანამ პირობა true არის.

# 1)
# ალგორითმი არის ნაბიჯ-ნაბიჯ ინსტრუქცია,
# რომლის დახმარებითაც ვწყვეტთ პრობლემას
# ან ვასრულებთ კონკრეტულ დავალებას.



# 2)
# საიტერაციო ცვლადი არის ცვლადი,
# რომელიც გამოიყენება ციკლში.
# მისი მნიშვნელობა იცვლება ყოველ გამეორებაზე.
    


# 3)
name = "Alexandre"
age = 14

for i in range(10):
    print(name)

for i in range(20):
    print(age)